Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: - Compile a list of license obligations that must be for using the FOSS in question and pass it to appropriate departments for fulfillment.
ja: - 対象となる FOSS を使用するために必要なライセンス義務のリストを編集し、対応する部署に渡します。

source: Additional compliance resources
ja: その他のコンプライアンス リソース

source: The checklist has no legal status or binding effect.
ja: チェックリストには法的資格や拘束力はありません。

source: The Linux Foundation promotes, protects, and advances Linux by providing unified resources and services needed for open source to successfully compete with closed platforms.
ja: The Linux Foundation は、Linux の普及促進、保護、ならびに発展に取り組み、Linux/OSS がクローズドなプラットフォームに対抗するのに必要とされる統合されたリソースとサービスを提供します。

source: There are several methods to identify the use of FOSS in the product:
ja: 製品における FOSS が使用されていることは、以下のような方法で確認できます。

source: - Completing appropriate reviews
ja: しかるべき調査を完了する

source: Updating notices as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「告知の更新」ステップ

source: This paper provides a practical and detailed discussion on the roles and responsibilities of the individual and team responsibilities in a comprehensive program to ensure FOSS compliance.
ja: このペーパーでは、FOSS コンプライアンスを徹底するための包括的なプログラムにおける人々やチームの役割と責任について、具体的かつ詳細に説明しています。

source: Components that live in kernel space versus user space
ja: カーネル スペースのコンポーネントか、ユーザー スペースのコンポーネントか

source: Clicking on a top file, hdhomerun_channels.c, will show us this contents of that source file (Figure 5) so your legal team can review the findings.
ja: 最初のファイル hdhomerun_channels.c をクリックすると、そのソース ファイルの内容 (図 5) が表示されるので、リーガル チームが結果を確認できます。

source: By saving scan results, the scanned software, and integrating multiple scanners, FOSSology became the next generation toolset for improving efficiency in the license compliance process.
ja: FOSSology は、スキャン結果とスキャンされたソフトウェアを保存し、複数のスキャナーを統合することにより、ライセンス コンプライアンス業務の効率を高める次世代ツールセットになりました。

source: Submit Requests to Use FOSS
ja: FOSS を使用するためのリクエストを提出する

source: The SPDXTMWorking Group
ja: SPDXTMワーキング グループ

source: Implementation of open source compliance processes can vary from company to company based on a number of factors: the underlying product development process into which compliance must fit, the size and nature of the code base, number of products turned out, the amount of externally supplied code, size and organizational structure of the company, and so on.
ja: オープン ソース コンプライアンス プロセスの実装は、コンプライアンスを適用する基本的な製品開発プロセス、コード ベースのサイズや特性、生産された製品の数、外部から供給されたコードの量、企業の規模や組織構造など、さまざまな理由で企業ごとに異なります。

source: See COPYING file for the full GPL license text.
ja: GPL ライセンス文書については、COPYING ファイルを参照してください。

source: Training courses are offered in various formats including Classroom Training, Online Training, On-Site Corporate Training and Custom Corporate Training.
ja: トレーニング コースには、クラスルーム トレーニング、オンライン トレーニング、オンサイト企業トレーニング、カスタム企業トレーニングなど、さまざまな形態のものがあります。

source: All files scanned are saved in the FOSSology file repository (with the exception of those submitted throught the web api).
ja: スキャンされたすべてのファイルは、FOSSology ファイル リポジトリに保存される (Web api を介してスキャンに供されたものは除く)。

source: The Open Compliance Program will make the checklist available in Q4 2010.
ja: このチェックリストは、2010 年度の後半に利用できるようになる予定です。

source: The organization regularly investigates commercial and OSS tools that might provide assistance to compliance activities.
ja: 組織は、コンプライアンス作業に役立つ可能性のある商用ツールや OSS ツールを定期的に調査している。

source: Several companies received negative publicity and/or were sued because they ignored requests to provide compliance information, did not know how to handle compliance inquires, lacked or had a poor compliance program, or simply refused to cooperate because they assumed the FOSS licenses are not enforceable.
ja: コンプライアンス情報を提供してほしいという要求を無視したために、悪い評判を立てられたり、訴えられたりする企業、コンプライアンスに関する照会をどう処理してよいかわからない企業、コンプライアンス プログラムが存在しないか整備されていない企業、あるいは FOSS のライセンスには法的強制力がないと思い、頑として協力を拒む企業もあります。

source: ii)A tool evaluation plan is established and executed.
ja: ii) ツール評価計画が確立され、実行されている。

source: Before releasing source code to the public, companies often perform a linguistic review to make sure that developers did not leave any comments about future products, product code names, mention of competitors, or any inappropriate comments.
ja: ソース コードを公開する前に、企業は通常、言語チェックを行い、開発者がソース コード内に将来の製品コード、製品名、競合に関する言及などの不適切なコメントを残していないか確認します。

source: A Glimpse Into Recommended Practices in a FOSS Compliance Management Process
ja: FOSS コンプライアンス管理プロセスにおける推奨プラクティスの紹介

source: Approve updates to product documentation with respect to FOSS notices
ja: FOSS 告知に関する製品ドキュメント更新の承認

source: - Identify licenses of scanned source code
ja: スキャンされたソース コードのライセンスを特定する

source: Legal Representative
ja: 法律顧問 (Legal Representative)

source: Identify all FOSS used in products
ja: 製品で使用しているすべての FOSS を特定する

source: Learn About Tools
ja: ツールについて学習する

source: Part I of the paper covers recommended practices that map to the various steps within a FOSS compliance management end-to-end process.
ja: パート Ⅰ では、FOSS コンプライアンス管理プロセスの各段階で履行するべきプラクティスについて説明します。

source: Information assets include free white papers, articles, and webinars available from noted compliance experts.
ja: 情報資料として、著名なコンプライアンス エキスパートによるフリー ホワイト ペーパー、記事、ウェビナーなどを使用します。

source: It’s necessary to standardize a way to exchange information about the licenses contained in a software package efficiently and accurately.
ja: ソフトウェア パッケージに含まれるライセンス情報を、効率的かつ正確に交換するための標準的方法が必要です。

source: Development teams may have introduced FOSS into proprietary or third party source code.
ja: 開発チームが、プロプライエタリ ソース コードやサード パーティ ソース コードの中で FOSS を利用している可能性があります。

source: The core set of requirements is typically complemented by specific requirements to support a particular process or set of best practices:
ja: 共通の要件に、以下のような特殊な要件を補うことにより、任意のプロセスや一連のベスト プラクティスをサポートします。

source: - Uploaded correctly
ja: 正常にアップロードされていること

source: Figure 5.
ja: 図 5

source: It is important to have executive level commitment to compliance.
ja: コンプライアンスに対するエグゼクティブ層の支持を得ることは重要です。

source: The results are written to the database and became available to all users of FOSSology (on that specific sever)
ja: 結果はデータベースに書き込まれ、そのサーバー上のすべての FOSSology ユーザーから参照可能となる

source: Servers
ja: サーバー

source: Community contributor license agreements are reviewed by the OSRB and the company's law department.
ja: コミュニティ貢献者用のライセンス契約が、OSRB および企業の法務部門によって調査されること。

source: The UEFI specification (version 2.3.1) is a bit dense, weighing in at 2,139 pages.
ja: UEFI 仕様 (バージョン 2.3.1) は少々難解で、2,139 ページもあります。

source: Supply Chain Management
ja: サプライ チェーン管理者

source: A Project may include all Packages necessary to build an entire distribution or it may simply be the workspace for a developer only containing the Packages the developer is working on.
ja: プロジェクトには、ディストリビューション全体をビルドするために必要なすべてのパッケージを含めることもできますが、開発者が扱うパッケージだけを含めて、単なる開発者用のワークスペースにすることもできます。

source: Bill of material difference tool
ja: BoM 比較ツール (Bill of material difference tool)

source: Most semiconductor manufacturers provide Linux as reference software.
ja: 多くの半導体メーカーは、リファレンス ソフトウェアとして Linux を提供しています。

source: Inform the end user of their product how to obtain a copy of the FOSS source code (when applicable, for example in the case of GPL and LGPL).
ja: 製品のエンド ユーザーに、対応する FOSS ソース コードのコピーの入手方法を通知します (たとえば GPL や LGPL など、ソース コードの提供が必要な場合)。

source: The are several commercial and FOSS tools that offer the capabilities of scanning source code and identifying what FOSS has been discovered in the source code base.
ja: ソース コードをスキャンし、ソース コード ベースでどのような FOSS コードが検出されたかを特定できる市販および FOSS ツールがあります。

source: b)The compliance team verifies that source code is placed in a distribution staging area for each OSS package included in a product readied for release and that a satisfactory distribution mechanism exists for any source code that must be made available.
ja: b) コンプライアンス チームは、リリース準備段階の製品に含まれている各 OSS パッケージの配布用ステージング領域にソース コードが配置されていること、および、公開の必要があるすべてのソース コードに対して、充分な配布メカニズムが存在することを検証する。

source: Course details and registration form can be found at http://www.linuxfoundation.org/programs/legal/compliance/training-and-education.
ja: コース内容と登録フォームについては、http://www.linuxfoundation.org/programs/legal/compliance/training-and-education をご覧ください。

source: The policy is signed by a senior executive and is communicated to the entire workforce.
ja: そのポリシーは役員レベルの管理者によって署名され、全従業員に周知されること。

source: The organization considers issues relevant to the use of a specific OSS package and version, e.g. bug fixes the community has made in subsequent versions, security vulnerabilities that have been identified in a specific package version, technology incorporated into the package that might be subject to export control regulations, etc.
ja: 組織は、特定の OSS パッケージおよびバージョンの使用に関する問題点を検討すること。たとえば、コミュニティが後続バージョンに施したバグ修正、特定のパッケージ バージョンに確認されたセキュリティ脆弱性、パッケージに組み込まれ、輸出管理規制の対象となる可能性のあるテクノロジなど。

source: Companies are invited to use this checklist as an internal self-administered exercise to evaluate their compliance in comparison to top tier best compliance practices.
ja: 企業は、これを使用して、自社のコンプライアンスと他の成功事例とを比較し、セルフチェックを行うことができます。

source: 09:00 GMT: Tree Reopens
ja: 09:00 (世界標準時): ツリー再開

source: Overview ofcompliance
ja: コンプライアンスの概要

source: Toolchain Management
ja: ツールチェーン管理

source: Localization Team
ja: ローカリゼーション チーム

source: - Incoming request to use FOSS: This is the most common method for identifying the usage of FOSS in product.
ja: FOSS を使用したいというリクエストを受ける。 製品での FOSS 使用を確認する最も一般的なパターンです。

source: - Auditing proprietary (company-developed) software components: In some instances, engineers may decide to copy/paste source code from FOSS components and include it in proprietary software components.
ja: プロプライエタリ (自社開発の) ソフトウェア コンポーネントを監査する。 たとえば、エンジニアが FOSS コンポーネントからソース コードをコピー&ペーストし、プロプライエタリ ソフトウェア コンポーネントに組み込もうとする場合があります。

source: Figure 4.
ja: 図 4

source: The SPDX™ Standard and Workgroup
ja: The SPDX™ ワークグループ

source: LF281 focuses the organization on the framework for an open source compliance program. Intended for corporate and senior managers, the course reviews open source licensing basics, compliance requirements, and the consequences of non-compliance.
ja: LF281 は、オープン ソース コンプライアンス プログラムの枠組みの構造に重点を置いています。企業の幹部社員の方向けに、オープン ソース ライセンスの基礎知識、コンプライアンスの要件、およびコンプライアンス不履行が招く結末について考察します。

source: Ensure that source code auditing is a milestone in the iterative development process.
ja: 反復的な開発プロセスの中に、確認ポイントとしてソース コード監査を組み込む。

source: On-Site Training is highly recommended to afford confidential and effective discussion of course material and its application to company practices.
ja: オンサイト トレーニングをお勧めしています。教材内容や実際のプラクティスへの応用について、機密事項も含めて効果的に議論することができるためです。

source: All-hands meetings are a great venue for executives to show their support and endorsement to the compliance activities and to ask their employees to follow company policies and processes.
ja: 全社会議: エグゼクティブ層がコンプライアンス活動への支持と支援を公表し、従業員に会社のポリシーとプロセスに従うよう求めることができる貴重な場となる。

source: Discovery and diligence costs in response to the compliance inquiry, where the company had to investigate the alleged inquiry and perform due diligence on the source code in question
ja: コンプライアンスに関する照会に対応するための調査のコスト。当該企業は、提示された質問事項について調査し、対応するソース コードを精査しなければなりません。

source: In the past few years, several cases of non-compliance found their way to the public.
ja: ここ数年、いくつかのコンプライアンス違反が公になっています。

source: Even for small software engineering organizations it makes very much sense to use a build system early on.
ja: 小規模なソフトウェア技術組織であっても、早期からビルド システムを使用すれば、非常に大きなメリットがあります。

source: An overview of a sample end-to-end compliance management process
ja: 徹底したコンプライアンス管理プロセスのサンプル概要

source: Activities to assess and satisfy OSS license obligations are planned and integrated into project schedules to assure that obligations are met in time for product release.
ja: OSS ライセンス義務を評価および履行する作業を計画し、プロジェクト スケジュールの予定に組み込み、製品リリースまでに義務が履行されるよう保証する。

source: The goal - to create a common software package data exchange(TM) format to simplify the discovery, collection and sharing of information about software packages and related content - promises to save time, improve the accuracy of license data collection, and simplify compliance with software licenses.
ja: このように「ソフトウェア パッケージと関連コンテンツに関する情報を簡単に検出、収集、および共有するために、共通の SPDX(TM) フォーマットを作成する」ことで、時間の短縮、ライセンス データ収集の精度向上、およびソフトウェア ライセンス順守の簡略化が約束されます。

source: Company to pay an undisclosed amount of financial consideration to the plaintiffs
ja: 企業は、その原告に対し、金額未公表ながら一定の支払いを行う

source: Continuous integration and build also helps load balancing of the build farm and early detection of integration issues since builds happen on request and not during scheduled times.
ja: ビルドは予定されたタイミングではなく、必要に応じて発生するため、継続的な統合とビルド処理は、ビルド ファームのロード バランシングや、統合問題の早期検出の助けになります。

source: Open source licensing fundamentals
ja: オープン ソース ライセンスの基本原理

source: FOSS compliance means that users of FOSS must observe all the copyright notices and satisfy all the license obligations for the FOSS they use in a commercial product.
ja: FOSS コンプライアンスとは、FOSS のユーザーが、製品で使用している FOSS について、すべての著作権表示を順守し、すべてのライセンス義務を果たすことを意味します。

source: It currently supports RPM and DEB package formats.
ja: 現在は、RPM 形式と DEB パッケージ形式をサポートしています。

source: 09:00 GMT: Weekly Release
ja: 09:00 (世界標準時): ウィークリー リリース

source: “Secure boot” is a technology described by recent revisions of the UEFI specification; it offers the prospect of a hardware-verified, malware-free operating system bootstrap process that can improve the security of many system deployments.
ja: "Secure boot (セキュア ブート)" は、最近の UEFI (Unified EFI) 仕様で規格化された技術です。secure boot は、ハードウェアによって検証された、マルウェアのない オペレーティング システム (OS) ブートストラップを可能とし、システム実装時のセキュリティを向上させます。

source: The extended team consists of various individuals and teams that act as supporting functions to the OSRB and contributing to the achievement of compliance.
ja: 拡張チームは、OSRB の機能を支援し、コンプライアンスの遂行に貢献する人々やチームによって構成されます。

source: Figure 7.
ja: 図 7

source: However, for any serious software engineering organization that extends beyond pure code development that functionality is required to successfully validate, package and ship software products.
ja: しかし、純粋なコード開発を超えて拡大する着実なソフトウェア技術組織には、ソフトウェア製品を正常に検証、パッケージング、および出荷するための機能が必要です。

source: Verification (audits and assessments used to confirm the right things were done)
ja: 検証 (正しい作業の完了を確認するための監査と評価)

source: Details
ja: 詳細

source: Discovery
ja: 検出

source: Dependency Checker Tool
ja: 依存状態チェッカー ツール (Dependency Checker Tool)

source: Pre-Distribution Verifications
ja: 配布前の検証

source: LinuxCon Japan Attendees:
ja: LinuxCon Japan 参加者の方へ

source: Planning
ja: 計画

source: The organization maintains complete and accurate records about OSS used internally for tools, operational systems, prototype development, etc.
ja: 組織は、ツール、運用システム、プロトタイプ開発などの目的で社内で使用される OSS について、完全かつ正確な記録を保持する。

source: If you were missing information as submitted by the inquirer, you would request additional information from them to help you isolate the precise problem.
ja: 照会者から提出された情報に不足がある場合は、彼らに追加情報を要求し、正確な問題点を見極める必要があります。

source: Organizations may wish to consider the following approaches to appraising individual compliance practices:
ja: 組織は、以下のような選択肢で各コンプライアンス事例を評価することができます。

source: The licenses of FOSS are not negotiated agreements.
ja: FOSS のライセンスは、契約に基づく合意ではありません。

source: Follow Technical Compliance Guidelines
ja: 技術的なコンプライアンス ガイドラインを順守する

source: This ensures consistency between local and server builds avoiding typical build environment configuration discrepancies that may cause hard to identify issues.
ja: これにより、問題を特定しにくくする原因となりがちな、ビルド環境構成の矛盾を排除でき、ローカル ビルドとサーバー ビルドとの整合性が保証されます。

source: - All notices have been captured and sent for fulfillment
ja: すべての告知情報が収集され、担当者に届けられている

source: The Linux Foundation promotes, protects and standardizes Linux by providing unified resources and services needed for open source to successfully compete with closed platforms.
ja: The Linux Foundation は、Linux の普及促進、保護、ならびに標準化に取り組み、Linux/OSS がクローズドなプラットフォームに対抗するのに必要とされる統合されたリソースとサービスを提供します。

source: Prior to Black Duck, Phil served in senior marketing, sales and business development positions with Empirix, High Performance Systems and Teradyne.
ja: 同社に入社する前は、Empirix、High Performance Systems、および Teradyne 社のシニア マーケティング、セールス、およびビジネス開発を担当していました。

source: Figure 6.
ja: 図 6

source: In this role, she managed the development of linux board support packages and basic enablement for new silicon.
ja: その際、Linux ボード サポート パッケージと、新しいシリコン向けの必要機能の開発を担当しました。

source: Members of the Core Team (OSRB)
ja: コア チームのメンバー (OSRB)

source: Half-day training focusing on the importance of compliance and what must be done to satisfy open source license obligations.
ja: 半日トレーニング。コンプライアンスの重要性、およびオープン ソース ライセンス義務を果たすために行うべきことに焦点を絞っています。

source: The Software Package Data Exchange (SPDX) Working Group
ja: ソフトウェア パッケージ データ交換 (SPDX™) ワーキング グループ

source: When the dispatcher receives a job description it identifies a suitable worker to execute the job and notifies the worker about the job.
ja: ディスパッチャーは、ジョブ仕様書を受け取ると、そのジョブの実行に最適なワーカーを特定し、そのワーカーにジョブについて通知します。

source: The self-assessment checklist presents a set of recommended practices distilled from the experiences of corporations committed to encouraging open source use while fully complying with OSS license obligations.
ja: 自己診断チェックリストは、OSS ライセンス義務を順守しつつオープン ソースの使用奨励に取り組んだ多くの企業の経験をもとに、推奨される一連のプラクティスを紹介しています。

source: Subscribe to the mailing list: https://lists.linux-foundation.org/mailman/listinfo/dep-checker-dev
ja: メーリング リストに登録: https://lists.linux-foundation.org/mailman/listinfo/dep-checker-dev

source: Ways to Train
ja: トレーニングの方法

source: In addition, the Linux Foundation has supported a number of community tool efforts that enhance compliance work.
ja: また LF では、このほかにも、コンプライアンスの履行を推進するさまざまなコミュニティ ツールの取り組みをサポートしています。

source: Advise on Licensing
ja: ライセンスに関する助言

source: When you perform scans with FOSSology, the license and copyright agents allow you a choice between one-shot analysis and a conventional analysis.
ja: FOSSology でスキャンを実行する際には、単発解析 (one-shot analysis) と通常解析 (conventional analysis) のどちらかを選択することができます。

source: The organization places into a software repository the complete source code corresponding exactly to each OSS package used in a given product release.
ja: 組織は、任意の製品リリースに使用されている各 OSS パッケージに厳密に対応した完全なソース コードをソフトウェア リポジトリに保存する。

source: The OSRB deploys new tools to be used as part of the compliance infrastructure that will contribute to making the compliance work more efficient and highly automated.
ja: OSRB は、コンプライアンスの効率化と自動化を高めるための新しいツールを導入します。

source: The Compliance Directory will be used to facilitate communication with company compliance officers when open source projects or copyright holders note concerns about use of their open source software.
ja: このコンプライアンス ディレクトリは、オープン コンプライアンス プロジェクトや著作権所有者が自分たちのオープン ソース ソフトウェアの使われ方に懸念を感じた時に、企業のコンプライアンス オフィサーとコミュニケーションをとる際に役立ちます。

source: Open Source Executive Committee (OSEC)
ja: オープン ソース 実行委員会 (OSEC)

source: Reviews
ja: 調査 (レビュー)

source: It should also be possible for the owner to return a system to setup mode in the future if needed.
ja: また、オーナーが必要に応じて、後からいつでもシステムを setup モードに戻すことができるようにする。

source: These projects contain more than 19,000 packages maintained in over 2,700 repositories.
ja: これらのプロジェクトは、2,700 個以上のリポジトリにある 19,000 パッケージを含んでいます。

source: This failure occurs when making available the wrong version of the source code used to compile into a FOSS binary work that has been distributed as part of a product.
ja: この違反は、製品の一部である FOSS バイナリ成果物のコンパイルに使用したのものとは異なるバージョンのソース コードを提供したときに発生する。

source: Making UEFI Secure Boot Work With Open Platforms
ja: オープン プラットフォームにおける UEFI Secure Boot への対応

source: For more details seetheCourse Outline.
ja: 詳細については、コース概要を参照してください。

source: As a result, discovery and labeling of open source components in commercial products will become easier and automated verification efforts will become feasible.
ja: その結果、商品に含まれるオープン ソース コンポーネントの検出やラベル付けが容易になり、自動検証作業が可能になります。

source: Section of results from copyright scan
ja: 著作権情報スキャンの結果

source: If the OSRB Chair identifies a linkage conflict, it is reported to Engineering to resolve it.
ja: OSRB チェアは、リンクの問題を検出した場合は、エンジニアリング部門に解決を指示します。

source: In addition to the responsibilities associated with participation in the OSRB, the Compliance Officer carries the following duties:
ja: コンプライアンス オフィサーは、以上のような OSRB への参加に伴う責任に加え、以下の責務を負います。

source: Notices
ja: 告知

source: The typical GPL violator started with a work under GPL, made some modifications to a small portion of the codebase, and then distributed the whole work in binary form only.
ja: 典型的な GPL 違反者は、GPL の下で作業を開始し、コードベースのごく一部分を修正した後、その全作品をバイナリ形式でのみ配布します。

source: Companies using FOSS in commercial products must exercise due diligence to comply with the terms of FOSS licenses while at the same time protecting their intellectual property, and that of 3rd party suppliers, from unintended disclosure.
ja: 商用製品で FOSS を使用している企業は、FOSS のライセンス条件を順守するための精査を行うと同時に、企業の知的財産とサード パーティ サプライヤーの知的財産の意図せざる開示を防ぐ必要があります。

source: Initiated by the Linux Foundation as an open source project, this tool identifies source code combinations at the dynamic and static link levels and provides a license policy framework that enables FOSS Compliance Officers to define combinations of licenses and linkage methods that are to be flagged if found as a result of running the tool.
ja: The Linux Foundation がオープン ソース プロジェクトとして開発したこのツールは、動的および静的リンク レべルでソース コードの組み合わせを認識します。FOSSコンプライアンス担当者は、ライセンスの混在やリンク方法をライセンス ポリシーとして定義でき、ツールがポリシー非準拠を発見した場合には警告されます。

source: a)The organization maintains a definition of who must take training.
ja: a) 組織は、トレーニングを受けるべき要員を定義すること。

source: - Participates in engineering design reviews, code inspections and distribution readiness assessment to assure that the engineering and product teams follow all compliance processes and policies and conforms to the approved OSRB usage form
ja: エンジニアリングの設計レビュー、コード検査、および配布準備評価に参加して、エンジニアリング/プロダクト チームがすべてのコンプライアンス プロセスとポリシーに従うよう保証し、承認された OSRB 使用申請書を順守する

source: Figure 9.
ja: 図 9

source: The organization provides a definition and examples of the information that must be submitted to the OSRB for approval of OSS use.
ja: 組織は、OSS 使用の承認を求めて OSRB に提出するべき情報の定義と例を提供する。

source: The following sub-sections describe what happens in each step of the compliance inquiry process.
ja: 次のサブセクションでは、コンプライアンス照会対応処理の各段階で何が発生するかを説明します。

source: Detailed release notes can be found on http://fossology.org.
ja: 詳細なリリース ノートについては、http://fossology.org を参照してください。

source: Build Acceleration ?
ja: ビルドの高速化

source: Adding licenses requires additions to C code.
ja: ライセンスを追加するには、C 言語のコードに追加しなければならない。

source: Fortunately a new working group is tackling one of the toughest obstacles to sharing information about software packages— collaborating on discovering and sharing information about software packages and their related content, including licenses
ja: 幸い、新しいワーキング グループが、ソフトウェア パッケージの情報共有に関する最も難しい問題の 1 つに取り組み始めました。すなわち、「ソフトウェア パッケージとその関連コンテンツ (ライセンスなど) に関する情報の検出と共有」のための協力です。

source: - Coordinate distribution of FOSS packages
ja: FOSS パッケージの配布処理を調整する

source: About the Authors
ja: 著者について

source: If signing is enabled, it hands built packages to the signing server to calculate hashes and signatures.
ja: 署名が可能な場合は、ビルト パッケージをサイニング サーバーに渡し、ハッシュと署名を計算します。

source: The BeagleBoard and is available for about $150.
ja: BeagleBoard は、約 150 米ドルです。

source: - Clean the source code from any comments that were left unintentionally.
ja: 不注意で残されてしまったコメントをソース コードから削除する

source: H/W Chips
ja: H/W チップ

source: - Confirm the origin(s) of the source code, including the provenance of any FOSS
ja: すべての FOSS を含めたソース コードの出自を確認する

source: A process failure modes effects analysis (FMEA) approach has been used to identify the ways a compliance process can fail and practices to prevent those process failures.
ja: コンプライアンス プロセスの失敗パターンと、そのような失敗を防ぐためのプラクティスを特定するために、プロセス失敗モード影響解析 (failure modes effects analysis: FMEA) アプローチを使用しています。
